app/Http/Controllers/ActivityController.php

    public function index()
    {
        //
        $activities = \App\Models\Activity::with(['company', 'contact', 'deal'])->get();
---
select * from "activities"
select * from "companies" where "companies"."id" in (1)
select * from "contacts" where "contacts"."id" in (2)
select * from "deals" where "deals"."id" in (3)

    public function create()
    {
        //
        //会社情報 ログインしてるuser_idのものだけ取得するように修正必要
        $companies = \App\Models\Company::all();
---
select * from "companies"

    public function store(Request $request)
    {
        //
        //バリデーション
        $validated = $request->validate([
            'company_id' => 'required|string',
            'contact_id' => 'required|string',
            'deal_id' => 'required|string',
            'type' => 'nullable|string',
            'title' => 'required|string|max:255',
            'description' => 'nullable|string',
            'date' => 'nullable|date',
            'status' => 'nullable|string',
        ],[
            'company_id.required' => '会社IDは必須です。',
        ]);

            //ログインしているユーザーのIDを追加
            $validated['user_id'] = auth()->id();

            //商談を作成
            \App\Models\Activity::create($validated);
---
insert into "activities" ("company_id", "contact_id", "deal_id", "type", "title", "description", "date", "status", "user_id", "updated_at", "created_at") values ('1', '2', '3', 'phone', 'q', 'a', '2026-01-12', 'schedule', 1, '2026-01-12 13:56:12', '2026-01-12 13:56:12')

    public function show($id)
    {
        //
        $companies = \App\Models\Company::all();
        $activity = \App\Models\Activity::findOrFail($id);
---
select * from "companies"
select * from "activities" where "activities"."id" = '1' limit 1

    public function edit($id)
    {
        //
        $companies = \App\Models\Company::all();
        $activity = \App\Models\Activity::findOrFail($id);
---
select * from "companies"
select * from "activities" where "activities"."id" = '1' limit 1

    public function update(Request $request, $id)
    {
        //
        $validated = $request->validate([
            'company_id' => 'required|string',
            'contact_id' => 'required|string',
            'deal_id' => 'required|string',
            'type' => 'nullable|string',
            'title' => 'required|string|max:255',
            'description' => 'nullable|string',
            'date' => 'nullable|date',
            'status' => 'nullable|string',
        ]);

        //商談を更新
        $companies = \App\Models\Company::all();
        $activity = \App\Models\Activity::findOrFail($id);
        $activity->update($validated);
---
select * from "companies"
select * from "activities" where "activities"."id" = '1' limit 1
update "activities" set "type" = 'phone', "description" = 'asdf', "status" = null, "updated_at" = '2026-01-13 15:24:17' where "id" = 1

    public function destroy($id)
    {
        //
        $activity = \App\Models\Activity::findOrFail($id);
        $activity->delete();
---
select * from "activities" where "activities"."id" = '3' limit 1
delete from "activities" where "id" = 3