app/Http/Controllers/ApiContactController.php

select * from "contacts" where "company_id" = '1'
---
    public function getConctactsByCompnay($companyId){
        $contacts = \App\Models\Contact::where('company_id', $companyId)->get();