app/Http/Controllers/ApiDealController.php

select * from "deals" where "company_id" = '1'
---
    public function getDealsByCompany($companyId) {
        $deals = \App\Models\Deal::where('company_id', $companyId)->get();