app/Http/Controllers/CompanyController.php

select * from "companies"
---
    public function index(){

        //会社一覧を取得してビューに渡す
        $companies = Company::query()
        ->company($request->company)
        ->get();

insert into "companies" ("name", "email", "phone", "website", "address", "description", "updated_at", "created_at") values ('iiii', 'test@gmail.com', '03-1111-1111', null, 'uuuu', null, '2025-12-14 11:10:58', '2025-12-14 11:10:58')
---
    public function store(Request $request){
        //バリデーション
        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'nullable|email|max:255',
            'phone' => 'nullable|string|max:20',
            'website' => 'nullable|url|max:255',
            'address' => 'nullable|string',
            'postal_code' => 'nullable|string|max:20',
            'city' => 'nullable|string|max:100',
            'industry' => 'nullable|string|max:100',
            'description' => 'nullable|string',
            'notes' => 'nullable|string',
        ]);

        //会社を作成
        $company = \App\Models\Company::create($validated);

select * from "companies" where "companies"."id" = '1' limit 1
---
    public function edit($id){
        $company = \App\Models\Company::findOrFail($id);