app/Http/Controllers/ContactController.php

select * from "contacts"
---
    public function index() {
        $contacts = \App\Models\Contact::all();

select * from "companies"
---
    public function create(){
        //会社情報 ログインしてるuser_idのものだけ取得するように修正必要
        $companies = \App\Models\Company::all();

insert into "contacts" ("company_id", "first_name", "last_name", "email", "position", "phone", "mobile", "notes", "user_id", "updated_at", "created_at") values ('1', 'oo', 'ii', 'u@gmail.com', 'aa', '03-1111-1111', '080-2222-2222', 'asdf', 1, '2025-12-04 09:01:05', '2025-12-04 09:01:05')
---
    public function store(Request $request){
        //バリデーション
        $validated = $request->validate([
            'company_id' => 'required|string',
            'first_name' => 'required|string|max:255',
            'last_name' => 'required|string|max:255',
            'email' => 'nullable|email|max:255',
            'position' => 'nullable|string',
            'phone' => 'nullable|string|max:20',
            'mobile' => 'nullable|string|max:20',
            'notes' => 'nullable|string',
        ],[
            'company_id.required' => '会社IDは必須です。',
        ]);

        //ログインしているユーザーのIDを追加

        $validated['user_id'] = auth()->id();


        // dd($validated);
        //連絡先を作成
        \App\Models\Contact::create($validated);

select * from "companies"
select * from "contacts" where "contacts"."id" = '2' limit 1
---
    public function show($id){
        $companies = \App\Models\Company::all();
        $contact = \App\Models\Contact::findOrFail($id);

select * from "companies"
select * from "contacts" where "contacts"."id" = '1' limit 1
---
    public function edit($id){
        $companies = \App\Models\Company::all();
        $contact = \App\Models\Contact::findOrFail($id);

select * from "companies"
select * from "contacts" where "contacts"."id" = '1' limit 1
update "contacts" set "first_name" = '山田', "position" = null, "email" = null, "phone" = null, "mobile" = null, "updated_at" = '2026-01-05 05:45:56' where "id" = 1
---
    public function update(Request $request, $id){
        //バリデーション
        $validated = $request->validate([
            'company_id' => 'required|string',
            // 'user_id' => 'required|string',
            'first_name' => 'required|string|max:255',
            'last_name' => 'required|string|max:255',
            'email' => 'nullable|email|max:255',
            'position' => 'nullable|string',
            'phone' => 'nullable|string|max:20',
            'mobile' => 'nullable|string|max:20',
            'notes' => 'nullable|string',
        ]);

        //会社を更新
        $companies = \App\Models\Company::all();
        $contact = \App\Models\Contact::findOrFail($id);
        $contact->update($validated);