app/Http/Controllers/DealController.php

    public function index()
    {
        //
        $deals = \App\Models\Deal::with(['company', 'contact'])->get();
---
select * from "companies" where "companies"."id" in (1)
select * from "contacts" where "contacts"."id" in (2)
select * from "deals"

    public function create()
    {
        //会社情報 ログインしてるuser_idのものだけ取得するように修正必要
        $companies = \App\Models\Company::all();
---
select * from "companies"

    public function show($id)
    {
        //
        $companies = \App\Models\Company::all();
        $deal = \App\Models\Deal::findOrFail($id);
---
select * from "companies"
select * from "deals" where "deals"."id" = '3' limit 1

    public function edit($id)
    {
        //
        $companies = \App\Models\Company::all();
        $deal = \App\Models\Deal::findOrFail($id);
---
select * from "companies"
select * from "deals" where "deals"."id" = '2' limit 1

    public function update(Request $request, $id)
    {
        //
        //バリデーション
        $validated = $request->validate([
            // 'company_id' => 'required|string',
            'contact_id' => 'required|string',
            'title' => 'required|string|max:255',
            'amount' => 'required|integer',
            'status' => 'nullable|string',
            'date' => 'nullable|date',
            'probability' => 'nullable|integer|between:0,100',
            'description' => 'nullable|string',
            'notes' => 'nullable|string'
        ]);

        //商談を更新
        $companies = \App\Models\Company::all();
        $deal = \App\Models\Deal::findOrFail($id);
        $deal->update($validated);
---
select * from "companies"
select * from "deals" where "deals"."id" = '2' limit 1
update "deals" set "status" = 'prospecting', "description" = null, "updated_at" = '2026-01-12 05:43:31' where "id" = 2